package dev.sorokin.domain.entity;

public enum PaymentStatus {
    NEW,                    // заказ только создан, оплата ещё не запускалась;

    AUTHORIZED,             // средства успешно авторизованы (захолдированы)

    AUTHORIZATION_FAILED,   // авторизация карты не прошла (банк/шлюз отказал, денег не хватило и т.п.) (терминальное состояние)

    PRICE_CHANGED_FAILED,   // финальная сумма после пересчёта склада оказалась больше, чем авторизованная, мы решили не списывать (терминальное состояние)

    TECHNICAL_FAILED,       // технический сбой при обработке платежа (терминальное состояние)

    SUCCEED_PAID,           // заказ успешно оплачен - списание прошло (терминальное состояние)
}